cloud-paas/com.primeton.upcloud.ws/src/main/resources/META-INF/ws/createStorageNasVolume_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://www.unionpay.com/ResourceService" xmlns:eos="http://www.priemton.com/EOS">
  <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                   <wsse:UsernameToken wsu:Id="UsernameToken-1815911473" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                            <wsse:Username>paas</wsse:Username>
                            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">000000</wsse:Password>
                   </wsse:UsernameToken>
     </wsse:Security>
         <eos:UserObject>
                   <eos:UserId>paas</eos:UserId>
         </eos:UserObject>
  </soapenv:Header>
   <soapenv:Body>
      <res:createStorageNasVolume>
         <!--Optional:-->
         <res:in0>2013091610242115</res:in0>
         <!--Optional:-->
         <res:in1>201310140001</res:in1>
         <!--Optional:-->
         <res:in2>upaas_group</res:in2>
         <!--Optional:-->
         <res:in3>3</res:in3>
         <!--Optional:-->
         <res:in4>
            <!--Zero or more repetitions:-->
             <res:string>192.168.100.31</res:string>
             <res:string>192.168.100.32</res:string>
		   <res:string>192.168.100.33</res:string>
 		   <res:string>192.168.100.30</res:string>
         </res:in4>
      </res:createStorageNasVolume>
   </soapenv:Body>
</soapenv:Envelope>